[
    {
        "img_name": "uf.jpeg",
        "alt_txt": "A white UF logo on a blue background",
        "workplace": "University of Florida",
        "job_title": "Research Assistant",
        "desc": [
            "Build a retrieval-augmented generation chat feature with Python, PostgreSQL, and Nvidia NIM APIs that leverages LLMs to quickly and accurately answer student questions about course-specific information.",
            "Utilize GitHub Actions to automate unit testing with pytest and deployment to a Linux server."
        ],
        "on_homepage": true,
        "time_range": "May 2024 - Present"
    },
    {
        "img_name": "uf.jpeg",
        "alt_txt": "A white UF logo on a blue background",
        "workplace": "University of Florida",
        "job_title": "Infrastructure Teaching Assistant",
        "desc": [
            "Maintained a Discord bot with a 92% approval rate used by over 1500 students in 7 UF courses.",
            "Developed the bot in Python with the discord.py API to automate course processes such as office hours.",
            "Managed a PostgreSQL database to efficiently store and query course-related data."
        ],
        "on_homepage": true,
        "time_range": "Dec 2023 - May 2024"
    },
    {
        "img_name": "sec.png",
        "alt_txt": "A white gator head on a light blue background",
        "workplace": "UF Software Engineering Club",
        "job_title": "Workshop Lead",
        "desc": [
            "Create, coordinate, and lead weekly technical workshops that teach software engineering skills to undergraduate students."
        ],
        "on_homepage": true,
        "time_range": "Sep 2023 - Present"
    },
    {
        "img_name": "flmnh.png",
        "alt_txt": "An F and M on a teal background",
        "workplace": "Florida Museum of Natural History",
        "job_title": "AI Research Assistant",
        "desc": [
            "Contribute to research on downscaling climate data to approximately 20x higher resolutions to improve crop yield predictions utilizing deep convolutional neural networks written with Python and PyTorch on the CUDA platform.",
            "Generate visualizations of meteorological data with cartopy to assess the accuracy of various models."
        ],
        "on_homepage": true,
        "time_range": "Aug 2023 - Present"
    },
    {
        "img_name": "codecraft_works.png",
        "alt_txt": "A yellow cartoon robot with gears on its body",
        "workplace": "Codecraft Works",
        "job_title": "Teaching Assistant",
        "desc": [
            "Educated and mentored middle school students in the fundamentals of web and mobile application development."
        ],
        "on_homepage": false,
        "time_range": "June 2023 - July 2023"
    },
    {
        "img_name": "osc.png",
        "alt_txt": "A drawing of a red and green neon sign of the phrase 'Open Source'",
        "workplace": "UF Open Source Club",
        "job_title": "Manim team member",
        "desc": [
            "Contribute to manim-data-structures, a plugin for the Manim math animation library to add support for animating data structures."
        ],
        "on_homepage": false,
        "time_range": "Jan 2023 - Dec 2023"
    },
    {
        "img_name": "ufpt.png",
        "alt_txt": "A white omega with a balloon in the center on a red-brown background",
        "workplace": "UF Programming Team",
        "job_title": "Vice President",
        "desc": [
            "Silver medalist in 2022 ICPC Southeast USA Regional.",
            "Apply knowledge of data structures and algorithms to solve programming problems under time pressure while communicating in a team of 3 to solve problems collaboratively."
        ],
        "on_homepage": true,
        "time_range": "Nov 2022 - Present"
    },
    {
        "img_name": "mycs.png",
        "alt_txt": "A drawing of Earth behind a mountain with the words \"2023 Youth Climate Summit wrapping around Earth\"",
        "workplace": "Miami Youth Climate Summit",
        "job_title": "Website developer",
        "desc": [
            "Worked in a team to collaboratively develop a functional and responsive website with React that educated viewers on climate change and provided information on attending the 2022 Miami Youth Climate Summit"
        ],
        "on_homepage": false,
        "time_range": "October 2021 - March 2022"
    },
    {
        "img_name": "terra.png",
        "alt_txt": "The word TERRA in a hand-drawn font with leaves and a globe of lines in the background",
        "workplace": "TERRA Environmental Research Institute Engineering Club",
        "job_title": "Head of software",
        "desc": [
            "Educated and mentored high school students in the fundamentals of programming."
        ],
        "on_homepage": false,
        "time_range": "September 2021 - May 2022"
    },
    {
        "img_name": "fiu.png",
        "alt_txt": "The letters F I and U with a blue fill and gold strokes",
        "workplace": "FIU Optical Imaging Laboratory",
        "job_title": "App development intern",
        "desc": [
            "Developed prototype version of a mobile app that reminds diabetic patients to administer preventative foot care and adjusted app to feedback from research team."
        ],
        "on_homepage": false,
        "time_range": "June 2021 - August 2021"
    }
]